Model Summary:
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 144, 288, 1)  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 144, 288, 32) 320         input_1[0][0]                    
__________________________________________________________________________________________________
activation (Activation)         (None, 144, 288, 32) 0           conv2d[0][0]                     
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 144, 288, 32) 9248        activation[0][0]                 
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 144, 288, 32) 0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 72, 144, 32)  0           activation_1[0][0]               
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 72, 144, 64)  18496       max_pooling2d[0][0]              
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 72, 144, 64)  0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 72, 144, 64)  36928       activation_2[0][0]               
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 72, 144, 64)  0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 36, 72, 64)   0           activation_3[0][0]               
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 36, 72, 128)  73856       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 36, 72, 128)  0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 36, 72, 128)  147584      activation_4[0][0]               
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 36, 72, 128)  0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 18, 36, 128)  0           activation_5[0][0]               
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 18, 36, 256)  295168      max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 18, 36, 256)  0           conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 18, 36, 256)  590080      activation_6[0][0]               
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 18, 36, 256)  0           conv2d_7[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 9, 18, 256)   0           activation_7[0][0]               
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 9, 18, 512)   1180160     max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 9, 18, 512)   0           conv2d_8[0][0]                   
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 9, 18, 512)   2359808     activation_8[0][0]               
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 9, 18, 512)   0           conv2d_9[0][0]                   
__________________________________________________________________________________________________
conv2d_transpose (Conv2DTranspo (None, 18, 36, 256)  1179904     activation_9[0][0]               
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 18, 36, 512)  0           conv2d_transpose[0][0]           
                                                                 activation_7[0][0]               
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 18, 36, 256)  1179904     concatenate[0][0]                
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 18, 36, 256)  0           conv2d_10[0][0]                  
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 18, 36, 256)  590080      activation_10[0][0]              
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 18, 36, 256)  0           conv2d_11[0][0]                  
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 36, 72, 128)  295040      activation_11[0][0]              
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 36, 72, 256)  0           conv2d_transpose_1[0][0]         
                                                                 activation_5[0][0]               
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 36, 72, 128)  295040      concatenate_1[0][0]              
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 36, 72, 128)  0           conv2d_12[0][0]                  
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 36, 72, 128)  147584      activation_12[0][0]              
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 36, 72, 128)  0           conv2d_13[0][0]                  
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 72, 144, 64)  73792       activation_13[0][0]              
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 72, 144, 128) 0           conv2d_transpose_2[0][0]         
                                                                 activation_3[0][0]               
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 72, 144, 64)  73792       concatenate_2[0][0]              
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 72, 144, 64)  0           conv2d_14[0][0]                  
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 72, 144, 64)  36928       activation_14[0][0]              
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 72, 144, 64)  0           conv2d_15[0][0]                  
__________________________________________________________________________________________________
conv2d_transpose_3 (Conv2DTrans (None, 144, 288, 32) 18464       activation_15[0][0]              
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 144, 288, 64) 0           conv2d_transpose_3[0][0]         
                                                                 activation_1[0][0]               
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 144, 288, 32) 18464       concatenate_3[0][0]              
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 144, 288, 32) 0           conv2d_16[0][0]                  
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 144, 288, 32) 9248        activation_16[0][0]              
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 144, 288, 32) 0           conv2d_17[0][0]                  
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 144, 288, 1)  33          activation_17[0][0]              
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 144, 288, 1)  0           conv2d_18[0][0]                  
==================================================================================================
Total params: 8,629,921
Trainable params: 8,629,921
Non-trainable params: 0
__________________________________________________________________________________________________

Training Results:
Loss function used: mse =  0.0013955178472804285
Metric function used: mse =  0.0013955178497839838
Metric function used: r_squared =  0.9942780917690647
Metric function used: standard_error_of_estimate =  0.03694530203938484

Testing Results:
Loss function used: mse =  0.0038155729954059306
Metric function used: mse =  0.003815573210326525
Metric function used: r_squared =  0.9856039835856512
Metric function used: standard_error_of_estimate =  0.06127868850643818

Training Confusion Matrix:
['TP' 'FP'] = [29564033      746]
['FN' 'TN'] = [  21694 8982487]

Training Confusion Stats For True Condition:
['TPR' 'FPR'] = [0.9992667410200872, 8.304359911403834e-05]
['FNR' 'TNR'] = [0.0007332589799128479, 0.999916956400886]

Training Confusion Stats for Predicted Condition:
['PPV' 'FDR'] = [0.9999747672729095, 2.5232727090569493e-05]
['FOR' 'NPV'] = [0.002409325179047378, 0.9975906748209526]

Training Confusion Accuracy:
0.9994181849860613

Testing Confusion Matrix:
['TP' 'FP'] = [3337312     560]
['FN' 'TN'] = [  2998 972218]

Testing Confusion Stats For True Condition:
['TPR' 'FPR'] = [0.9991024785124734, 0.0005756709136102995]
['FNR' 'TNR'] = [0.0008975214875266068, 0.9994243290863897]

Testing Confusion Stats for Predicted Condition:
['PPV' 'FDR'] = [0.9998322284377591, 0.00016777156224085285]
['FOR' 'NPV'] = [0.0030741907433840298, 0.996925809256616]

Testing Confusion Accuracy:
0.9991750689992878

Correlation Between SMAP Train and Pred Train:
R =  0.9235464183076345

Correlation Between SMAP Test and Pred Test:
R =  0.7924074166881219

